first_routes/app/controllers/users_controller.rb

  def index
    user = User.all
---
SELECT "users".* FROM "users"

  def update
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Willy"], ["email", "wietwilly@gmail.com"], ["updated_at", "2018-09-10 22:10:35.351093"], ["id", 2]]

  def destroy
    user = User.find(params[:id])
    if user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]